0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet1
    {
        type            zeroGradient;
    }

    Inlet2
    {
        type            zeroGradient;
    }

    Outlet
    {
        type            totalPressure;
        p0              uniform 11380;
    }

    Wall
    {
        type            zeroGradient;
    }

    Open
    {
        type            totalPressure;
        p0              uniform 0;
    }

}

// ************************************************************************* //
