0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0000342;

boundaryField
{
    Inlet1
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
	type		zeroGradient;
    }

    Open
    {        
	type            zeroGradient;
    }

    Wall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
